function generate() {
    var affirmation = [
        "Соня",

        "Лена",

        "Алёна",

        "Ирина",

        "Катя",

        "Святослав",

        "Настя",

        "Максим",

        "Вика",

        "Аня",

        "Аглая",

        "Гермиона",

        "Ингрид",

        "Наташа",

        "Надя",

        "Роза",

        "Лиза",

        "Полина",

        "Ева",

        "Даша",

        "Лёша",

        "Андрей",

        "Женя",

        "Ксюша",

        "Оля",

        "Лика",

        "Дима",

        "Маша",

        "Марфа",

        "Маруся",

        "Богдан",

        "Грета",

        "Милана",

        "Саша",

        "Рита",

        "Альберт",

        "Барбара",

        "Валентина",

        "Драко",

        "Гарри",

        "Наруто",

        "Афина",

        "Октябрина",

        "Вова",

        "Россия",

        "Даниэлла",

        "Илья",

        "Архип",

        "Будда",

        "Иисус",

        "Степан",

        "Гена",

        "Гарик",

        "Сергей",

        "Михаил",

        "Жора",

        "Хабиба",
    
    ];
    var txt=document.querySelector('p');
    txt.innerHTML=affirmation[Math.floor(Math.random()*affirmation.length)];
    }
    